ИТ_Фирма/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПродажиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИТ_Фирма/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Требуется согласовать документ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныПродажиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекущаяСтрока Из Цены Цикл
		
		Отбор = Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		
		СтрокаТаблицы = Цены.НайтиСтроки(Отбор);
		
		Если СтрокаТаблицы.Количество() > 1 Тогда 
			
			Сообщить("Проведение не возможно. Обнаружены дубли номенклатуры");
			Отказ = Истина;
			
		КонецЕсли;	
		
		Движение = Движения.ЦеныПродажиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.Ответственный = Ответственный;
		Движение.Цена = ТекущаяСтрока.Цена;
		
	КонецЦикла;	
	
КонецПроцедуры
